{
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "comments",
    "1": "current_operations",
    "2": "management_summary",
    "3": "operations_summary",
    "4": "planned_operations",
    "5": "safety_information",
    "6": "well_information"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "comments": 0,
    "current_operations": 1,
    "management_summary": 2,
    "operations_summary": 3,
    "planned_operations": 4,
    "safety_information": 5,
    "well_information": 6
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
